import pandas as pd
from automation.vosoli.helpers import scores, calculate_score

df = pd.read_excel(
    r'E:\automating_reports_V2\saved_dir\test\vosoli\report_new.xlsx')

df = df.reset_index()

df_vosoli = pd.read_excel(
    r'E:\automating_reports_V2\saved_dir\test\vosoli\vosoli.xlsx', sheet_name='new')

df_vosoli['امتیاز درصد رشد'] = df_vosoli['درصد رشد'].apply(
    lambda x: calculate_score((x * 100), 'roshd'))

df_vosoli['امتیاز درصد تحقق'] = df_vosoli['درصد تحقق'].apply(
    lambda x: calculate_score((x * 100), 'tahaghogh'))

df_vosoli['امتیاز درصد وزن'] = df_vosoli['سهم از وصولی 7 ماهه'].apply(
    lambda x: calculate_score((x * 100), 'vazn'))

df_vosoli['امتیاز نهایی وصولی'] = df_vosoli['امتیاز درصد رشد'] + \
    df_vosoli['امتیاز درصد تحقق'] + df_vosoli['امتیاز درصد وزن']
df_vosoli['امتیاز مکتسبه وصولی'] = (
    df_vosoli['امتیاز نهایی وصولی']/int(df_vosoli['امتیاز نهایی وصولی'].max())).apply(lambda x: f'{x:.2%}')

df_vosoli[' 40 درصدی امتیاز مکتسبه'] = (df_vosoli['امتیاز نهایی وصولی']/int(
    df_vosoli['امتیاز نهایی وصولی'].max()) * 0.4).apply(lambda x: f'{x:.2%}')


df_vosoli = df_vosoli[['شهر', 'درصد رشد', 'درصد تحقق', 'سهم از وصولی 7 ماهه', 'امتیاز نهایی وصولی',
                       'امتیاز مکتسبه وصولی', ' 40 درصدی امتیاز مکتسبه']]


cols = [cols for cols in df.columns.tolist()]

df_g = df.groupby(['کد اداره', 'نام اداره',
                  'نوع اظهارنامه'])

lst = []

for k, v in df_g:
    score = scores[v['نوع اظهارنامه'].item()]
    v['امتیاز رسیدگی حقیقی'] = v['تعداد تشخیص صادره مالیات بر درآمد مشاغل در 257 روز گذشته'] * \
        score['رسیدگی']['حقیقی']
    v['امتیاز رسیدگی حقوقی'] = v['تعداد تشخیص صادره مالیات بر درآمد شرکت ها در 257 روز گذشته'] * \
        score['رسیدگی']['حقوقی']
    v['امتیاز رسیدگی ارزش افزوده'] = v['تعداد تشخیص صادره مالیات بر ارزش افزوده در 257 روز گذشته'] * \
        score['رسیدگی']['ارزش افزوده']
    v['امتیاز رسیدگی مستغلات'] = v['تشخیص صادره مستغلات'] * \
        score['رسیدگی']['مستغلات']
    v['امتیاز رسیدگی 169'] = v['تشخیص صادره 169 حقوقی سنتی'] * \
        score['رسیدگی']['169']
    v['امتیاز رسیدگی تکلیفی'] = v['تشخیص صادره تکلیفی حقوقی سنتی'] * \
        score['رسیدگی']['تکلیفی']
    v['امتیاز رسیدگی حقوق'] = v['تشخیص صادره حقوق حقوقی سنتی'] * \
        score['رسیدگی']['حقوق']
    v['امتیاز رسیدگی ارزش افزوده تبصره 6'] = v['تعداد رسیدگی اطلاعیه چهارم و پنجم ارزش افزوده- تبصره  6'] * 2

    v['امتیاز قطعی حقیقی'] = v['تعداد قطعی صادره مالیات بر درآمد مشاغل در 257 روز گذشته'] * \
        score['قطعی']['حقیقی']
    v['امتیاز قطعی حقوقی'] = v['تعداد قطعی صادره مالیات بر درآمد شرکت ها در 257 روز گذشته'] * \
        score['قطعی']['حقوقی']
    v['امتیاز قطعی ارزش افزوده'] = v['تعداد قطعی صادره مالیات بر ارزش افزوده در 257 روز گذشته'] * \
        score['قطعی']['ارزش افزوده']
    v['امتیاز قطعی مستغلات'] = v['قطعی صادره مستغلات'] * \
        score['قطعی']['مستغلات']
    v['امتیاز قطعی 169'] = v['قطعی صادره 169 حقوقی سنتی'] * \
        score['قطعی']['169']
    v['امتیاز قطعی تکلیفی'] = v['قطعی صادره تکلیفی حقوقی سنتی'] * \
        score['قطعی']['تکلیفی']
    v['امتیاز قطعی صادره عملکرد حقوقی سنتی'] = v['قطعی صادره عملکرد حقوقی سنتی'] * \
        score['قطعی']['حقوقی']
    v['امتیاز قطعی حقوق'] = v['قطعی صادره حقوق حقوقی سنتی'] * score['قطعی']['حقوق']
    v['امتیاز تشخیص ابلاغی حقیقی'] = v['تعداد تشخیص ابلاغی مالیات بر درآمد مشاغل در 257 روز گذشته'] * \
        score['ابلاغ']['حقیقی']
    v['امتیاز تشخیص ابلاغی حقوقی'] = v['تعداد تشخیص ابلاغی مالیات بر درآمد شرکت ها در 257 روز گذشته'] * \
        score['ابلاغ']['حقوقی']
    v['امتیاز تشخیص ابلاغی ارزش افزوده'] = v['تعداد تشخیص ابلاغی مالیات بر ارزش افزوده در 257 روز گذشته'] * \
        score['ابلاغ']['ارزش افزوده']
    v['امتیاز تشخیص ابلاغ شده عملکرد حقوقی سنتی'] = v['تشخیص ابلاغ شده عملکرد حقوقی سنتی'] * \
        score['ابلاغ']['حقوقی']
    v['امتیاز تشخیص ابلاغی مستغلات'] = v['تشخیص ابلاغ شده مستغلات'] * \
        score['ابلاغ']['مستغلات']
    v['امتیاز تشخیص ابلاغی 169'] = v['تشخیص ابلاغ شده 169 حقوقی سنتی'] * \
        score['ابلاغ']['169']
    v['امتیاز تشخیص ابلاغی تکلیفی'] = v['تشخیص ابلاغ شده تکلیفی حقوقی سنتی'] * \
        score['ابلاغ']['تکلیفی']
    v['امتیاز تشخیص ابلاغی حقوق'] = v['تشخیص ابلاغ شده حقوق حقوقی سنتی'] * \
        score['ابلاغ']['حقوق']
    v['امتیاز توافق 238 عملکرد شرکت ها سنتی'] = v['توافق 238 عملکرد شرکت ها سنتی'] * \
        score['238']['حقوقی']
    v['امتیاز توافق 238 حقوق شرکت ها سنتی'] = v['توافق 238 حقوق شرکت ها سنتی'] * \
        score['238']['حقوق']
    v['امتیاز توافق 238 تکلیفی شرکت ها سنتی'] = v['توافق 238 تکلیفی شرکت ها سنتی'] * \
        score['238']['تکلیفی']
    v['امتیاز توافق 238 ،169 شرکت ها سنتی'] = v['توافق 238 ،169 شرکت ها سنتی'] * \
        score['238']['169']
    v['امتیاز قطعی ابلاغی مستغلات'] = v['قطعی ابلاغ شده مستغلات'] * \
        score['ابلاغ']['مستغلات']
    v['امتیاز قطعی ابلاغی 169'] = v['قطعی ابلاغ شده 169 حقوقی سنتی'] * \
        score['ابلاغ']['169']
    v['امتیاز قطعی ابلاغی تکلیفی'] = v['قطعی ابلاغ شده تکلیفی حقوقی سنتی'] * \
        score['ابلاغ']['تکلیفی']
    v['امتیاز قطعی ابلاغی حقوق'] = v['قطعی ابلاغ شده حقوق حقوقی سنتی'] * \
        score['ابلاغ']['حقوق']
    v['امتیاز قطعی ابلاغی حقوق'] = v['قطعی ابلاغ شده عملکرد حقوقی سنتی'] * \
        score['ابلاغ']['حقوقی']

    v['امتیاز مانده 97'] = v['جمع کل مانده'] * -0.0001

    cols_sum = [col for col in v.columns.tolist() if 'امتیاز' in col]

    v['امتیاز کلی'] = v[cols_sum].sum(axis=1)

    lst.append(v)

df_final = pd.concat(lst)
lst = []

for k_, v_ in df_final.groupby(['نام اداره', 'کد اداره']):
    v_['امتیاز نهایی'] = v_['امتیاز کلی'].sum(axis=0)
    lst.append(v_)

df_final = pd.concat(lst)

df_final.sort_values(by=['امتیاز نهایی'],
                     inplace=True, ascending=False)

df_final['امتیاز مکتسبه فرایندی'] = (
    df_final['امتیاز نهایی']/int(df_final['امتیاز نهایی'].max())).apply(lambda x: f'{x:.2%}')
df_final[' 60 درصدی امتیاز مکتسبه'] = (df_final['امتیاز نهایی']/int(
    df_final['امتیاز نهایی'].max()) * 0.6).apply(lambda x: f'{x:.2%}')


df_merge = df_final.merge(df_vosoli, how='left',
                          left_on='کد اداره', right_on='شهر')

df_merge['امتیاز درصدی کل'] = ((df_merge['امتیاز نهایی']/int(df_merge['امتیاز نهایی'].max()) * 0.6) +
                               (df_merge['امتیاز نهایی وصولی']/int(df_merge['امتیاز نهایی وصولی'].max()) * 0.4))
df_merge.sort_values(by=['امتیاز درصدی کل'],
                     ascending=False, inplace=True)

df_merge['امتیاز درصدی کل'] = df_merge['امتیاز درصدی کل'].apply(
    lambda x: f'{x:.2%}')


df_merge.set_index(['نام اداره', 'کد اداره', 'امتیاز نهایی وصولی', 'امتیاز درصدی کل', 'امتیاز نهایی', 'امتیاز مکتسبه وصولی', 'امتیاز مکتسبه فرایندی',
                    ' 40 درصدی امتیاز مکتسبه', ' 60 درصدی امتیاز مکتسبه', 'نوع اظهارنامه', 'امتیاز کلی'], inplace=True)

df_merge.reset_index().set_index(['نام اداره', 'کد اداره', 'نوع اظهارنامه']).\
    to_excel(r'E:\automating_reports_V2\saved_dir\test\mahad.xlsx')
