------------------AMAR------------------------
SELECT 
distinct
      [کد اداره]
      ,[نام اداره]
	  ,COUNT([شماره اظهارنامه]) AS [تشخیص صادره حقیقی و حقوقی 1397]
  FROM 
  (
  SELECT 
distinct
       [شماره اقتصادی]
      ,[کد رهگيري ثبت نام ]
      ,[کد اداره]
      ,[نام اداره]
      ,[شماره اظهارنامه]
      ,[سال عملکرد]
      ,[منبع مالیاتی]
      ,[دوره عملکرد]
      ,[تاریخ صدور برگ تشخیص (تاریخ تایید گزارش حسابرسی)]
	  ,iif(LEN([تاریخ صدور برگ تشخیص (تاریخ تایید گزارش حسابرسی)])>5,1,NULL) AS Vaziat
	  ,[تاريخ ايجاد برگ قطعي]
	  ,[نوع اظهارنامه]
  FROM [testdb].[dbo].[V_PORTAL]
   WHERE 
  [منبع مالیاتی] IN(N'مالیات بر درآمد شرکت ها',N'مالیات بر درآمد مشاغل')
  AND [سال عملکرد] IN ('1397')
  AND [تاریخ صدور برگ تشخیص (تاریخ تایید گزارش حسابرسی)] BETWEEN '1403/01/25' AND '1403/02/25'
  )as a
 
  GROUP BY [کد اداره],[نام اداره]