------------------AMAR------------------------
SELECT 
distinct
      [کد اداره]
      ,[نام اداره]
	  ,COUNT(*) AS [تشخیص قطعی شده بدون اعتراض و هیات-سنیم]
  FROM 
  (
  SELECT 
distinct
       [شماره اقتصادی]
      ,[نام مودی]
	  ,[نام پدر]
	  ,[آدرس]
	  ,[تاریخ تولد]
      ,[کد رهگيري ثبت نام ]
      ,[کد اداره]
      ,[نام اداره]
      ,[شماره اظهارنامه]
      ,[سال عملکرد]
      ,[منبع مالیاتی]
      ,[دوره عملکرد]
      ,[تاریخ صدور برگ تشخیص (تاریخ تایید گزارش حسابرسی)]
	  ,[شماره برگ تشخیص]
	  ,[تاریخ ابلاغ برگ تشخیص]
	  ,[درآمد ابرازی]
	  ,[مالیات ابرازی]
	  ,[درآمد تشخیص]
	  ,[مالیات تشخیص]
	  ,[تاریخ اعتراض]
	  ,[تاریخ رای]
	  ,[تاریخ تایید رای]
	  ,[تاريخ بسته شدن اعتراض يا شکايت]
	  ,[توافق]
	  ,[قرار ]
	  ,[تعديل]
	  ,[رفع تعرض]
	  ,[تاييد]
	  ,[شماره درخواست هیات بدوی]
	  ,[تاريخ ايجاد برگ دعوت بدوی]
      ,[تاریخ رای بدوی]
	  ,[شماره درخواست هیات تجدید نظر]
	  ,[تاريخ ايجاد دعوتنامه تجديدنظر]
      ,[تاریخ رای تجدید نظر]
	  ,[منبع قطعیت(صدور برگ قطعی در چه مرحله ای اتفاق افتاده است)]
	  ,[تاريخ ايجاد برگ قطعي]
	  ,[تاریخ ابلاغ برگ قطعی]
	  ,[درآمد قطعی]
	  ,[مالیات قطعی]
	  ,[نام حسابرس]
	  ,[پرداختی از اصل مالیات]
	  ,[مانده بدهی از اصل مالیات]
	  ,[نوع اظهارنامه]
  FROM [testdb].[dbo].[V_PORTAL]
   WHERE 
  LEN([تاریخ صدور برگ تشخیص (تاریخ تایید گزارش حسابرسی)])>5
  AND LEN([تاریخ ایجاد کیس حسابرسی])>5
  AND LEN([تاریخ اعتراض])=''
  AND [شماره درخواست هیات بدوی]=''
  AND [شماره درخواست هیات تجدید نظر]=''
  AND LEN([تاريخ ايجاد برگ قطعي])>5
  AND [تاريخ ايجاد برگ قطعي] BETWEEN '1403/01/25' AND '1403/02/25'

  )as a
   GROUP BY [کد اداره],[نام اداره]