------------------AMAR------------------------
SELECT 
distinct
      [کد اداره]
      ,[نام اداره]
	  ,COUNT([شماره اظهارنامه]) AS [تعداد پرونده ارسالی به هیات سنیم]
  FROM 
  (
  SELECT 
distinct
       [شماره اقتصادی]
      ,[کد رهگيري ثبت نام ]
      ,[کد اداره]
      ,[نام اداره]
      ,main.[شماره اظهارنامه]
      ,[سال عملکرد]
      ,[منبع مالیاتی]
      ,[دوره عملکرد]
      ,[تاریخ صدور برگ تشخیص (تاریخ تایید گزارش حسابرسی)]
	  ,[تاریخ اعتراض]
	  ,[تاریخ رای]
	  ,[تاریخ تایید رای]
	  ,[شماره درخواست هیات بدوی]
	  ,[تاریخ اعتراض هیات بدوی]
	  ,[تاريخ ايجاد برگ قطعي]
	  ,[نوع اظهارنامه]
  FROM [testdb].[dbo].[V_PORTAL] as main
  WHERE 
  --LEN([تاریخ اعتراض])>5
  --AND LEN([تاریخ تایید رای])>5
   LEN([تاریخ صدور برگ تشخیص (تاریخ تایید گزارش حسابرسی)])>5
  AND SUBSTRING([تاریخ اعتراض هیات بدوی],1,4)+'/'+SUBSTRING([تاریخ اعتراض هیات بدوی],5,2)+'/'+SUBSTRING([تاریخ اعتراض هیات بدوی],7,2) BETWEEN '1403/01/25' AND '1403/02/25'
  )as a 
  GROUP BY [کد اداره],[نام اداره]