------------------AMAR------------------------
SELECT 
distinct
      [کد اداره]
      ,[نام اداره]
	  ,COUNT(*) AS [قطعی سازی اوراق دارای تشخیص]
  FROM 
  (
  SELECT 
distinct
       [شماره اقتصادی]
      ,[کد رهگيري ثبت نام ]
      ,[کد اداره]
      ,[نام اداره]
      ,[شماره اظهارنامه]
      ,[سال عملکرد]
      ,[منبع مالیاتی]
      ,[دوره عملکرد]
      ,[تاریخ صدور برگ تشخیص (تاریخ تایید گزارش حسابرسی)]
	  ,[تاريخ ايجاد برگ قطعي]
  FROM [testdbv2].[dbo].[V_PORTAL]
  WHERE 
  [منبع مالیاتی] IN(N'مالیات بر درآمد مشاغل',N'مالیات بر درآمد شرکت ها')
  AND LEN([تاریخ صدور برگ تشخیص (تاریخ تایید گزارش حسابرسی)])>5
  AND LEN([تاريخ ايجاد برگ قطعي])>5
  AND [تاريخ ايجاد برگ قطعي] BETWEEN '1403/01/25' AND '1403/02/25'
  )as a
  
  GROUP BY [کد اداره],[نام اداره]


